backend/controllers/AdditionalInfoController.php

    public function actionCreate()
    {
        $model = new AdditionalInfo();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO "additional_info" ("title", "description", "category_id") VALUES ('scsdc', 'dfvdfbdfb', 1) RETURNING "id"

    protected function findModel($id)
    {
        if (($model = AdditionalInfo::findOne($id)) !== null) {
---
SELECT * FROM "additional_info" WHERE "id"='1'