backend/controllers/NewsController.php

    public function actionCreate()
    {
        $model = new News();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO "news" ("title", "description") VALUES ('TEt', 'sdfsdfsdf') RETURNING "id"

    protected function findModel($id)
    {
        if (($model = News::findOne($id)) !== null) {
---
SELECT * FROM "news" WHERE "id"='2'