common/models/News.php

    public function upload()
    {
        if ($this->validate() && $this->imageFile) {
            $filename = md5($this->id) . '.' . $this->imageFile->extension;
            $this->updateAttributes(['image' => $filename]);
---
UPDATE "news" SET "image"='c81e728d9d4c2f636f067f89cc14862c.jpg' WHERE "id"=2