backend/views/additional-info/_form.php


    <?= $form->field($model, 'description')->textarea(['rows' => 6]) ?>

    <?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(Categories::find()->where(['is_active' => true])->all(), 'id', 'title')) ?>
---
SELECT * FROM "categories" WHERE "is_active"=TRUE